# tap brew
tap "homebrew/cask"
tap "buo/cask-upgrade"
tap "homebrew/cask-versions"
tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/services"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"

# brew installs
brew "fish"
brew "git"
brew "mas"
brew "wget"
brew "node"
brew "yarn"
brew "jq"
brew "tree"
brew "postgresql"
brew "mysql@5.7"
#brew "git-flow"
brew "python3"
brew "watchman"

# brew cask install dev-tools
cask "bartender"
cask "cleanmymac"
cask "istat-menus"
cask "jetbrains-toolbox"
cask "mongodb"
cask "ngrok"
cask "iterm2"
cask "postman"
cask "sourcetree"
cask "visual-studio-code"
cask "zeplin"
cask "mysqlworkbench"
#cask "fork"
cask "Postgres"
cask "pgadmin4"
cask "mongodb-compass"
#cask "slack"
cask "docker"
tap "adoptopenjdk/openjdk"
cask "homebrew/cask-versions/adoptopenjdk8"

# brew cask install apps
# cask "mounty"
cask "alfred"
cask "keepingyouawake"
#cask "iglance"
#cask "cakebrew"
#cask "karabiner-elements"
cask "appcleaner"
cask "ccleaner"
cask "avast-security"
#cask "signal"
cask "homebrew/cask/notion"

# fonts
cask 'font-d2coding'
cask 'font-nanumgothic'
cask 'font-nanummyeongjo'
cask 'font-source-code-pro'
cask 'font-fira-code'

# brew cask install browsers
cask "google-chrome"
cask "chromium"
cask "homebrew/cask-versions/firefox-developer-edition"
cask "brave-browser"

# Mac Appstore
mas "Spark - Email App by Readdle", id: 1176895641
mas "Bear", id: 1091189122
mas "LastPass Password Manager", id: 926036361
mas "Trello", id: 1278508951
mas "Things3", id: 904280696
mas "Pages", id: 409201541
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Magnet", id: 441258766
mas "Allkdic", id: 1033453958
mas "KakaoTalk", id: 869223134
mas "PopClip", id: 445189367
mas "Pastebot", id: 1179623856
#mas "Evernote", id: 406056744
mas "Bandizip", id: 1265704574
mas "Slack", id: 803453959
mas "Foldery", id: 815333099
mas "PopClip", id: 445189367
#mas "Boom3D", id: 1233048948
mas "MindNode 5", id: 1289197285
mas "HwpMac2014VIEWER", id: 416746898
mas "Unicorn Blocker:Adblock", id: 1231935892
mas "Telegram", id: 747648890
mas "Affinity Photo", id: 824183456
mas "Affinity Designer", id: 824171161
mas "Xcode", id: 497799835
